/*******************************************************************************
* タイトル:		プレイヤーヘッダー
* プログラム名:	Shop.h
* 作成者:		GP11A132 99 外岡高明
* 作成日:		2022/05/26
*******************************************************************************/

#pragma once	// インクルードガード（多重インクルード防止）

/*******************************************************************************
* インクルードファイル
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define SHOP_MAX 11

// 20 は多分バッグってる

/*******************************************************************************
* 構造体定義
*******************************************************************************/



struct SHOP
{
	// フィールド用メンバー変数
	int x;				// X座標
	int y;				// Y座標

	int old_x;			// 一歩前のX座標
	int old_y;			// 一歩前のY座標


	// バトル用メンバー変数
	int hp, hp_max;		// HP / HP Max
	int atk, atk_max;	// 攻撃力


	// Shops

	int Shops;

	bool enabled;


};


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitShop(void);
void UninitShop(void);
void UpdateShop(void);
void DrawShop(void);
void ShopTransaction(void);

// custom method

//void DisplayShops(void);

// プレイヤーのアドレスを返す
SHOP *GetShop(void);